---
lab:
  title: "Ejercicio 06: Realización de la búsqueda de amenazas en Microsoft\_Sentinel"
  module: Guided Project - Create detections and perform investigations using Microsoft Sentinel
---

## Información general del ejercicio

Eres un analista de operaciones de seguridad que trabaja en una empresa que ha implementado Microsoft Sentinel. Debes aprender a detectar y mitigar amenazas mediante Microsoft Sentinel. Después de conectar los orígenes de datos a Microsoft Sentinel, crea reglas de análisis personalizadas que te ayuden a detectar las amenazas y los comportamientos anómalos de tu entorno.

Las consultas de búsqueda de amenazas permiten a los analistas de SOC supervisar e investigar de forma proactiva posibles ataques a medida que se están desarrollando o antes de que se produzcan. La búsqueda en Microsoft Sentinel permite que las consultas similares a las reglas analíticas se usen para auditar el entorno para actividades potencialmente malintencionadas, al tiempo que permite a los analistas escalar los resultados de incidentes si es necesario. A veces, las amenazas de búsqueda pueden requerir datos que superen la retención del nivel de análisis (frecuente), donde se pueden usar características como trabajos de búsqueda y restauración para asegurarse de que el SOC tiene los datos que necesita.

## Instrucciones del ejercicio

### Tarea 1: crear una consulta de búsqueda

En esta tarea, crearás una consulta de búsqueda y marcarás un resultado.

1. Inicia sesión en la máquina virtual WIN1 como administrador con la contraseña: **Pa55w.rd**.  

1. En el explorador Edge, ve a Azure Portal en <https://portal.azure.com>.

1. En el cuadro de diálogo **Iniciar sesión**, copia y pega la cuenta **Correo electrónico de inquilino** que ha facilitado el proveedor de hospedaje de laboratorio y luego selecciona **Siguiente**.

1. En el cuadro de diálogo **Escribir contraseña**, copia y pega la **Contraseña de inquilino** que ha facilitado el proveedor de hospedaje de laboratorio y luego selecciona **Iniciar sesión**.

1. En la barra de búsqueda de Azure Portal, escribe *Sentinel* y luego selecciona **Microsoft Sentinel**.

1. Selecciona el área de trabajo de Microsoft Sentinel.

1. Selecciona **Registros**

1. Escribe la siguiente instrucción KQL en el espacio *Nueva consulta 1*:

   >**Importante:** pega primero las consultas de KQL en el Bloc de notas y luego copia de allí a la ventana de registro *Nueva consulta 1* para evitar errores.

    ```KQL
    let lookback = 2d; 
    SecurityEvent 
    | where TimeGenerated >= ago(lookback) 
    | where EventID == 4688 and Process =~ "powershell.exe"
    | extend PwshParam = trim(@"[^/\\]*powershell(.exe)+" , CommandLine) 
    | project TimeGenerated, Computer, SubjectUserName, PwshParam 
    | summarize min(TimeGenerated), count() by Computer, SubjectUserName, PwshParam 
    | order by count_ desc nulls last 
    ```
